&НаКлиенте
Процедура ПриОткрытии(Отказ)

	МассивМесяцев = Новый Массив;
	СообщитьОМассиве(МассивМесяцев);
	
	Номер = 1;

КонецПроцедуры

&НаКлиенте
Процедура СообщитьОМассиве(МассивМесяцев)

	Сообщить("==== Массив ==== ");
	Сообщить("Элементы массива: ");
	Индекс = 0;
	Для каждого ЭлементМассиваМесяцев Из МассивМесяцев Цикл
		Индекс = Индекс + 1;
		Сообщить("Элемент " + Индекс + ":" + ЭлементМассиваМесяцев);
	КонецЦикла;
	Сообщить("Верхняя граница = " + МассивМесяцев.ВГраница());
    Сообщить("Количество элементов в массиве = " + МассивМесяцев.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВМассив(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	СообщитьОМассиве(МассивМесяцев);
	
	Если МассивМесяцев.Количество() < 12 Тогда
		МассивМесяцев.Добавить(ВведитеМесяц);
		Сообщить("В конец массива добавлен элемент """ + ВведитеМесяц + """.");

		ПоказатьМассивДанных(МассивМесяцев);
		СообщитьОМассиве(МассивМесяцев);
	Иначе
		 Сообщить("Добавление невозможно! Массив заполнен.");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВсеЭлементыМассива(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	СообщитьОМассиве(МассивМесяцев);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеМассиваДанными(МассивДанных)
	
    МассивЭлементовНаФорме = Новый Массив;
	
	МассивЭлементовНаформе.Добавить(Элемент1);
	МассивЭлементовНаформе.Добавить(Элемент2);
	МассивЭлементовНаформе.Добавить(Элемент3);
	МассивЭлементовНаформе.Добавить(Элемент4);
	МассивЭлементовНаформе.Добавить(Элемент5);
	МассивЭлементовНаформе.Добавить(Элемент6);
	МассивЭлементовНаформе.Добавить(Элемент7);
	МассивЭлементовНаформе.Добавить(Элемент8);
	МассивЭлементовНаформе.Добавить(Элемент9);
	МассивЭлементовНаформе.Добавить(Элемент10);
	МассивЭлементовНаформе.Добавить(Элемент11);
	МассивЭлементовНаформе.Добавить(Элемент12);

	Для Индекс = 0 По МассивЭлементовНаформе.ВГраница() Цикл
		Если Не ПустаяСтрока(МассивЭлементовНаформе[Индекс]) Тогда
			МассивДанных.Вставить(Индекс,МассивЭлементовНаформе[Индекс]);
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьНомерПустогоЭлемента(НашМассив)
	
	Индекс = 0;
	
	Пока Не ПустаяСтрока(НашМассив[Индекс]) Цикл
		Индекс = Индекс + 1;
		Если Индекс = НашМассив.Количество() Тогда
		   	Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Индекс < НашМассив.Количество() Тогда
		Сообщить("Номер пустого элемента = " + (индекс+1) );
	Иначе 
		Сообщить("Массив заполнен.");	
	КонецЕсли;
	
	
	Возврат Индекс;
	
КонецФункции 

&НаКлиенте
Процедура ПоказатьМассивДанных(НашМассивДанных)
	
	МассивДанных = Новый Массив(12);
	
	Индекс = 0;
	Для каждого ЭлементМас Из НашМассивДанных Цикл
		МассивДанных.Установить(Индекс,ЭлементМас);
		Индекс = Индекс + 1;
		Если Индекс = 12 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элемент1  = МассивДанных[0];
	Элемент2  = МассивДанных[1];
	Элемент3  = МассивДанных[2];
	Элемент4  = МассивДанных[3];
	Элемент5  = МассивДанных[4];
	Элемент6  = МассивДанных[5];
	Элемент7  = МассивДанных[6];
	Элемент8  = МассивДанных[7];
	Элемент9  = МассивДанных[8];
	Элемент10 = МассивДанных[9];
	Элемент11 = МассивДанных[10]; 
	Элемент12 = МассивДанных[11];
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассивДаннымиПоУмолчанию(Команда)

	МассивМесяцев = Новый Массив;
	МассивМесяцев.Добавить("Январь");
	МассивМесяцев.Добавить("Февраль");
	МассивМесяцев.Добавить("Март");
	МассивМесяцев.Добавить("Апрель");
	МассивМесяцев.Добавить("Май");
	МассивМесяцев.Добавить("Июнь");
	МассивМесяцев.Добавить("Июль");
	МассивМесяцев.Добавить("Август");
	МассивМесяцев.Добавить("Сентябрь");
	МассивМесяцев.Добавить("Октябрь");
	МассивМесяцев.Добавить("Ноябрь"); 
	МассивМесяцев.Добавить("Декабрь");
	
	ПоказатьМассивДанных(МассивМесяцев);
	СообщитьОМассиве(МассивМесяцев);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВМассив(Команда)

	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	Если МассивМесяцев.Количество() = 12 Тогда
		Сообщить("Вставить невозможно! Массив заполнен!");
	Иначе
		Если Номер > 0 И Номер < 13 Тогда
			
			МассивМесяцев.Вставить(Номер-1,ЗначениеЭлемента); 
			
			ПоказатьМассивДанных(МассивМесяцев);
			СообщитьОМассиве(МассивМесяцев); 
		Иначе
			
			Сообщить("Вставить невозможно!");
			
		КонецЕсли;		
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиНомер(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	Индекс = МассивМесяцев.Найти(ЗначениеНомерКоторогоНужноНайти);
	
	Если Индекс <> Неопределено Тогда
		РезультатПоиска = Строка(Индекс+1);
	Иначе
		РезультатПоиска = "Не найдено!";
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМассив(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев); 
	
	МассивМесяцев.Очистить();
	
	ПоказатьМассивДанных(МассивМесяцев);
	СообщитьОМассиве(МассивМесяцев);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗначение(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	Если НомерЗначения > 0 И НомерЗначения < МассивМесяцев.Количество()+1 Тогда
		ЗначениеПоНомеру = Строка(МассивМесяцев.Получить(НомерЗначения-1));
	Иначе 
		Сообщить("Некорректное значение номера!");
		ЗначениеПоНомеру = "";
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлемент(Команда)
		
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	Если НомерДляУдаления > 0 И НомерДляУдаления < МассивМесяцев.Количество()+1 Тогда
		МассивМесяцев.Удалить(НомерДляУдаления-1);
		Сообщить("Элемент удален!");
		ПоказатьМассивДанных(МассивМесяцев);
		СообщитьОМассиве(МассивМесяцев);
 	Иначе 
		Сообщить("Некорректное значение номера!");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначение(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	Если НомерВМассиве > 0 И НомерВМассиве < МассивМесяцев.Количество()+1 Тогда
		МассивМесяцев.Установить(НомерВМассиве-1,УстанавливаемоеЗначение);
		Сообщить("Элемент установлен!");
		ПоказатьМассивДанных(МассивМесяцев);
		СообщитьОМассиве(МассивМесяцев);
 	Иначе 
		Сообщить("Некорректное значение номера!");
	КонецЕсли;		
КонецПроцедуры


