
&НаКлиенте
Процедура СоздатьТаблицуЗначений(Команда)
	

	СоздатьТаблицуЗначенийНаСервере(); 

	
КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицуЗначенийНаСервере()
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипПеречисления = Новый  ОписаниеТипов("ПеречислениеСсылка.ВремяГода");
	ТипЧисло = Новый  ОписаниеТипов("Число");
	
	НашаТаблицаЗначений = Новый ТаблицаЗначений;
	НашаТаблицаЗначений.Колонки.Добавить("Месяц", ТипСтрока , "Месяц");
	НашаТаблицаЗначений.Колонки.Добавить("ВремяГода", ТипПеречисления , "Время года");
	НашаТаблицаЗначений.Колонки.Добавить("НомерМесяца", ТипЧисло , "Номер месяца"); 
	НашаТаблицаЗначений.Колонки.Добавить("Бюджет", ТипЧисло , "Бюджет");
	
	СтрокаТЗ = НашаТаблицаЗначений.Добавить();
	СтрокаТЗ.Месяц       = "Январь"; 
	СтрокаТЗ.ВремяГода   = Перечисления.ВремяГода.Зима;
	СтрокаТЗ.НомерМесяца = 1;
	СтрокаТЗ.Бюджет = 30000;

	СтрокаТЗ = НашаТаблицаЗначений.Добавить();
	СтрокаТЗ.Месяц       = "Февраль"; 
	СтрокаТЗ.ВремяГода   = Перечисления.ВремяГода.Зима;
	СтрокаТЗ.НомерМесяца = 2;
	СтрокаТЗ.Бюджет = 30000;
	
	СтрокаТЗ = НашаТаблицаЗначений.Добавить();
	СтрокаТЗ.Месяц       = "Март"; 
	СтрокаТЗ.ВремяГода   = Перечисления.ВремяГода.Весна;
	СтрокаТЗ.НомерМесяца = 3;  
	СтрокаТЗ.Бюджет = 30000;
		
	СтрокаТЗ = НашаТаблицаЗначений.Добавить();
	СтрокаТЗ.Месяц       = "Январь"; 
	СтрокаТЗ.ВремяГода   = Перечисления.ВремяГода.Зима;
	СтрокаТЗ.НомерМесяца = 1;
	СтрокаТЗ.Бюджет = 30000;

	СтрокаТЗ = НашаТаблицаЗначений.Добавить();
	СтрокаТЗ.Месяц       = "Февраль"; 
	СтрокаТЗ.ВремяГода   = Перечисления.ВремяГода.Зима;
	СтрокаТЗ.НомерМесяца = 2; 
	СтрокаТЗ.Бюджет = 30000;
		
	СтрокаТЗ = НашаТаблицаЗначений.Добавить();
	СтрокаТЗ.Месяц       = "Март"; 
	СтрокаТЗ.ВремяГода   = Перечисления.ВремяГода.Весна;
	СтрокаТЗ.НомерМесяца = 3;
	СтрокаТЗ.Бюджет = 30000;
	
	СообщитьОТаблицеЗначений(НашаТаблицаЗначений);
	ЗначениеВРеквизитФормы(НашаТаблицаЗначений,"ТаблицаНаФорме");

КонецПроцедуры

&НаСервере
Процедура СообщитьОТаблицеЗначений(НашаТаблицаЗначений)

	
	Сообщить("==== Таблица значений ====");
	Для каждого СтрокаТЗ Из НашаТаблицаЗначений Цикл
		 Сообщить( СтрокаТЗ.Месяц + " - " +
				   СтрокаТЗ.ВремяГода + " - " +
				   СтрокаТЗ.НомерМесяца +" - " +
		           СтрокаТЗ.Бюджет);	
	КонецЦикла;
	
КонецПроцедуры




&НаКлиенте
Процедура СвернутьТаблицуЗначений(Команда)
	СвернутьТаблицуЗначенийНаСервере();
КонецПроцедуры


&НаСервере
Процедура СвернутьТаблицуЗначенийНаСервере()
	ТЗнаФорме = РеквизитФормыВЗначение("ТаблицаМесяцев");
	ТЗнаФорме.Свернуть("Месяц , ВремяГода", "НомерМесяца");
	ЗначениеВРеквизитФормы(ТЗнаФорме,"ТаблицаМесяцев");
КонецПроцедуры


&НаКлиенте
Процедура СвернутьТаблицу(Команда)
	
	 СвернутьТаблицуНаСервере();

КонецПроцедуры     


&НаСервере
Процедура СвернутьТаблицуНаСервере()
	ТЗнаФорме = РеквизитФормыВЗначение("ТаблицаНаФорме"); 
	//суммирует бюджет при свертке
	ТЗнаФорме.Свернуть("Месяц , ВремяГода, НомерМесяца", "Бюджет");
	ЗначениеВРеквизитФормы(ТЗнаФорме,"ТаблицаНаФорме");
    СообщитьОТаблицеЗначений(ТЗнаФорме);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКолонку(Команда)
	ДобавитьКолонкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкуНаСервере()
	
	ТЗнаФорме = Новый ТаблицаЗначений;
	ТЗнаФорме = РеквизитФормыВЗначение("ТаблицаНаФорме"); 
	ТЗнаФорме.Колонки.Добавить("Год", Новый ОписаниеТипов("Строка")); 
	ТЗнаФорме.ЗаполнитьЗначения("2022", "Год");
	
    Сообщить("==== Таблица значений ====");
	Для каждого СтрокаТЗ Из ТЗнаФорме Цикл
		 Сообщить( СтрокаТЗ.Месяц + " - " +
				   СтрокаТЗ.ВремяГода + " - " +
				   СтрокаТЗ.НомерМесяца +" - " +
		           СтрокаТЗ.Бюджет + " - " +
		           СтрокаТЗ.Год);	
	КонецЦикла;

	ЗначениеВРеквизитФормы(ТЗнаФорме,"ТаблицаНаФорме");
	
КонецПроцедуры


