&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СообщитьОСпискеЗначений(СписокЗначенийНаФорме);
	Если СписокЗначенийНаФорме.Количество() = 0 Тогда
		Сообщить("Список пуст!");	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСписокЗначенийДаннымиПоУмолчанию(Команда)

	СПЗ = Новый СписокЗначений;
	ДобавитьВСписокЗначенийДанныеПоУмолчанию(СПЗ);
	СообщитьОСпискеЗначений(СПЗ);
	ЗагрузитьДанныеВСписокЗначенийНаФорме(СПЗ);
	ОчиститьПоляНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВСписокЗначенийНаФорме(НашСписокЗначений)
	
	СписокЗначенийНаФорме.Очистить();	
	Для каждого ЭлементСЗ Из НашСписокЗначений Цикл
		 СписокЗначенийНаФорме.Добавить(ЭлементСЗ.Значение,ЭлементСЗ.Представление)
	КонецЦикла;

КонецПроцедуры



&НаКлиенте
Процедура ДобавитьВСписокЗначенийДанныеПоУмолчанию(НашСписокЗначений)
	
	НашСписокЗначений.Добавить( 1, "Январь"  );
	НашСписокЗначений.Добавить( 2, "Февраль" );
	НашСписокЗначений.Добавить( 3, "Март"    );
	НашСписокЗначений.Добавить( 4, "Апрель"  );
	НашСписокЗначений.Добавить( 5, "Май"     );
	НашСписокЗначений.Добавить( 6, "Июнь"    );
	НашСписокЗначений.Добавить( 7, "Июль"    );
	НашСписокЗначений.Добавить( 8, "Август"  );
	НашСписокЗначений.Добавить( 9, "Сентябрь");
	НашСписокЗначений.Добавить(10, "Октябрь" );
	НашСписокЗначений.Добавить(11, "Ноябрь"  );
	НашСписокЗначений.Добавить(12, "Декабрь" );
	
КонецПроцедуры 

&НаКлиенте
Процедура СообщитьОСпискеЗначений(НашСписокЗначений)
	
	Сообщить("==== СписокЗначений ====");
	Для Каждого ЭлемСписка из НашСписокЗначений Цикл
		Сообщить(Строка(ЭлемСписка.Значение) + " - "  + ЭлемСписка.Представление);
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура СообщитьКоличествоЭлементовСпискаЗначения(Команда)

	Сообщить("Количество элементов списка значений " + СписокЗначенийНаФорме.Количество());
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьМассивВСписокЗначений(Команда)
	
	МассивМесяцев = Новый Массив;
	
	МассивМесяцев.Добавить("Январь"  );
	МассивМесяцев.Добавить("Февраль" );
	МассивМесяцев.Добавить("Март"    );
	МассивМесяцев.Добавить("Апрель"  );
	МассивМесяцев.Добавить("Май"     );
	МассивМесяцев.Добавить("Июнь"    );
	МассивМесяцев.Добавить("Июль"    );
	МассивМесяцев.Добавить("Август"  );
	МассивМесяцев.Добавить("Сентябрь");
	МассивМесяцев.Добавить("Октябрь" );
	МассивМесяцев.Добавить("Ноябрь"  ); 
	МассивМесяцев.Добавить("Декабрь" );

	
	СписокМесяцев = Новый СписокЗначений;
	СписокМесяцев.ЗагрузитьЗначения(МассивМесяцев);
	

	Индекс = 1;
	Для каждого ЭлемСписка Из СписокМесяцев Цикл
		ЭлемСписка.Представление = Строка(Индекс);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	
	ЗагрузитьДанныеВСписокЗначенийНаФорме(СписокМесяцев);
	СообщитьОСпискеЗначений(СписокМесяцев);
	ОчиститьПоляНаФорме();
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьЭлементПоИндексу(Команда)
	
	Сообщить("Элемент:"+ СписокЗначенийНаФорме.Получить(ВведитеИндекс).Значение + " - " + СписокЗначенийНаФорме.Получить(ВведитеИндекс).Представление );
    Сообщить("Элемент:"+ СписокЗначенийНаФорме[ВведитеИндекс].Значение + " - " + СписокЗначенийНаФорме[ВведитеИндекс].Представление );
	
КонецПроцедуры





&НаКлиенте
Процедура ВыбратьМесяц(Команда)
	НовоеОписание = Новый ОписаниеОповещения("ПослеВыбораМесяца", ЭтаФорма);
	СписокЗначенийНаФорме.ПоказатьВыборЭлемента(НовоеОписание, "Выберете месяц");
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеВыбораМесяца(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Сообщить("Неопределено");
		
	Иначе
		Месяц = ВыбранныйЭлемент.Значение;
		
		ВыбранныйМесяц = Строка(ВыбранныйЭлемент.Значение); 
		Представление  = Строка(ВыбранныйЭлемент.Представление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДаннымиСправочника(Команда)
	
	СписокЗначенийНаФорме.Очистить();
	ЗаполнитьСписокДаннымиСправочникаНаСервере(); 
	СообщитьОСпискеЗначений(СписокЗначенийНаФорме);
	ОчиститьПоляНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДаннымиСправочникаНаСервере()
	
	
	ВыборкаМесяцев = Справочники.Месяцы.Выбрать(); 
	
	Пока ВыборкаМесяцев.Следующий() Цикл
		СписокЗначенийНаФорме.Добавить(ВыборкаМесяцев.Ссылка,ВыборкаМесяцев.Ссылка);
	КонецЦикла;
	

КонецПроцедуры  


&НаКлиенте
Процедура ОчиститьПоляНаФорме()
	
	Месяц          = "";
	ВыбранныйМесяц = ""; 
	Представление  = "";
	
КонецПроцедуры

