
&НаКлиенте
Процедура ЗаполнитьСтруктуруДаннымиПоУмолчанию(Команда)
	
	СтруктураМесяцы = Новый Структура;
	ВставитьВСтруктуруДанныеПоУмолчанию(СтруктураМесяцы);
	ВывестиСтруктуруМесяцыВТЗнаФорме(СтруктураМесяцы);
    СообщитьДанныеВСтруктуре(СтруктураМесяцы);

		
КонецПроцедуры 

&НаКлиенте
Процедура ВставитьВСтруктуруДанныеПоУмолчанию(СтруктураМесяцы)
	
	//цифра не может быть ключом
	СтруктураМесяцы.Вставить("Январь",  1);
	СтруктураМесяцы.Вставить("Февраль", 2);
	СтруктураМесяцы.Вставить("Март",    3);
	СтруктураМесяцы.Вставить("Апрель",  4);
	СтруктураМесяцы.Вставить("Май",     5);
	СтруктураМесяцы.Вставить("Июнь",    6);
	СтруктураМесяцы.Вставить("Июль",    7);
	СтруктураМесяцы.Вставить("Август",  8);
	СтруктураМесяцы.Вставить("Сентябрь",9);
	СтруктураМесяцы.Вставить("Октябрь", 10);
	СтруктураМесяцы.Вставить("Ноябрь",  11);
	СтруктураМесяцы.Вставить("Декабрь", 12);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьДанныеВСтруктуре(СтруктураМесяцы)
	
	Сообщить("==== Структура ====");
  
	
	Для Каждого Элемент Из СтруктураМесяцы Цикл
        Сообщить(Строка(Элемент.Ключ) + " / " + Строка(Элемент.Значение));// Ключ / Значение
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьКоличествоЭлементовСтруктуры(Команда)
	
	СтруктураМесяцы = Новый Структура;
	ВставитьВСтруктуруДанныеИзТЗнаФорме(СтруктураМесяцы);
	Сообщить("Количество элементов структуры : " + СтруктураМесяцы.Количество());

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчистку(Команда)
	
	СтруктураМесяцы = Новый Структура;
	ВставитьВСтруктуруДанныеИзТЗнаФорме(СтруктураМесяцы);
	
	СтруктураМесяцы.Очистить();
	
	ТЗнаФорме.Очистить();
	
	Сообщить("Очистка выполнена");
	Сообщить("Количество элементов структуры : " + СтруктураМесяцы.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьСвойство(Команда)
	
	СтруктураМесяцы = Новый Структура;
	ВставитьВСтруктуруДанныеИзТЗнаФорме(СтруктураМесяцы);
	НомерМесяца = Неопределено;
	
	Если СтруктураМесяцы.Свойство(КлючМесяц,НомерМесяца) Тогда
		Сообщить("Свойство """ + КлючМесяц + """ найдено. Значение: " + НомерМесяца);
	Иначе
		Сообщить("Свойство """ + КлючМесяц + """не найдено.");
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоКлючу(Команда)

	СтруктураМесяцы = Новый Структура;
	ВставитьВСтруктуруДанныеИзТЗнаФорме(СтруктураМесяцы);
	
	Если СтруктураМесяцы.Свойство(КлючМесяц) Тогда
		СтруктураМесяцы.Удалить(КлючМесяц);
		ВывестиСтруктуруМесяцыВТЗнаФорме(СтруктураМесяцы);
		Сообщить("Удалён элемент структуры с заданным ключом.");
		Сообщить("Количество элементов структуры : " + СтруктураМесяцы.Количество());
	Иначе 
		Сообщить("Элемента с ключом """ + КлючМесяц + """не найдено.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСтруктуруМесяцыВТЗнаФорме(СтруктураМесяцы)

	ТЗнаФорме.Очистить();
	Для каждого Элемент Из СтруктураМесяцы Цикл
		
		ТекущаяСтрока          = ТЗнаФорме.Добавить();
		ТекущаяСтрока.Ключ     = Элемент.Ключ;
		ТекущаяСтрока.Значение = Элемент.Значение;

	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ВставитьВСтруктуруДанныеИзТЗнаФорме(СтруктураМесяцы)
	
   	Для каждого ТекСтрока Из ТЗнаФорме Цикл
		СтруктураМесяцы.Вставить(ТекСтрока.Ключ, ТекСтрока.Значение);		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ВставитьВСтруктуру(Команда)
	
	
	Если ПустаяСтрока(ВведитеКлюч) Тогда
		
		Сообщить("Нельзя вставить пустой ключ. Введите ключ! Например, Январь");
		
	Иначе
		
		СтруктураМесяцы = Новый Структура;
		ВставитьВСтруктуруДанныеИзТЗнаФорме(СтруктураМесяцы);
	
		СтруктураМесяцы.Вставить(ВведитеКлюч,ВведитеЗначение);
		
		ВывестиСтруктуруМесяцыВТЗнаФорме(СтруктураМесяцы);
		СообщитьДанныеВСтруктуре(СтруктураМесяцы);
		
	КонецЕсли;
	
КонецПроцедуры

