&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Сообщить("Массив структур пуст. Добавьте структуру.");
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОМассиве(МассивМесяцев)

	Сообщить("==== Массив структур ==== ");
	Индекс = 0;
	Для каждого ЭлементМассиваМесяцев Из МассивМесяцев Цикл
		Индекс = Индекс + 1;
		Сообщить("Структура " + Строка(Индекс) + ": " + Строка(ЭлементМассиваМесяцев.НомерВГоду) +", " + ЭлементМассиваМесяцев.НазваниеМесяца + ", " + Строка(ЭлементМассиваМесяцев.НомерКвартала) + ", " + ЭлементМассиваМесяцев.ВремяГода);
	КонецЦикла;
	Сообщить("Верхняя граница = " + МассивМесяцев.ВГраница());
    Сообщить("Количество элементов в массиве = " + МассивМесяцев.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВМассив(Команда)
	
	МассивМесяцев   = Новый Массив;
	//заполнить массив из таблицы 
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	ЗаписьСтруктура = Новый Структура;
	ЗаписьСтруктура.Вставить("НомерВГоду",ВведитеНомерМесяцаВГоду);
	ЗаписьСтруктура.Вставить("НазваниеМесяца",ВведитеМесяц);
	ЗаписьСтруктура.Вставить("НомерКвартала",ВведитеНомерКвартала);
	ЗаписьСтруктура.Вставить("ВремяГода", ВведитеВремяГода);
	
	Если МассивМесяцев.Количество() < 12 Тогда
		МассивМесяцев.Добавить(ЗаписьСтруктура);
		Сообщить("В конец массива добавлен элемент """ + ЗаписьСтруктура.НазваниеМесяца + """.");

		ПоказатьМассивДанных(МассивМесяцев);
		СообщитьОМассиве(МассивМесяцев);
	Иначе
		Сообщить("Добавление невозможно! Массив заполнен.");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВсеЭлементыМассива(Команда)
	
	МассивМесяцев = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	
	СообщитьОМассиве(МассивМесяцев);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеМассиваДанными(МассивДанных)

	Для каждого ТекСтрока Из ТЗнаФорме Цикл
		МассивДанных.Добавить(ТекСтрока);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМассивДанных(НашМассивДанных)
	ТЗнаФорме.Очистить();
	Для каждого ЭлементМас Из НашМассивДанных Цикл
		
		ТекущаяСтрока                = ТЗнаФорме.Добавить();
		ТекущаяСтрока.НомерВГоду     = ЭлементМас.НомерВГоду;
		ТекущаяСтрока.НазваниеМесяца = ЭлементМас.НазваниеМесяца;
		ТекущаяСтрока.НомерКвартала  = ЭлементМас.НомерКвартала;
		ТекущаяСтрока.ВремяГода      = ЭлементМас.ВремяГода;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассивДаннымиПоУмолчанию(Команда)

	МассивМесяцев = Новый Массив;
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",1);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Январь");
	ЗаписьСтруктура.Вставить("НомерКвартала",1);
	ЗаписьСтруктура.Вставить("ВремяГода", "Зима");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	//ЗаписьСтруктура.Очистить();
	//ЗаписьСтруктура.Удалить();
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",2);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Февраль");
	ЗаписьСтруктура.Вставить("НомерКвартала",1);
	ЗаписьСтруктура.Вставить("ВремяГода", "Зима");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",3);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Март");
	ЗаписьСтруктура.Вставить("НомерКвартала",1);
	ЗаписьСтруктура.Вставить("ВремяГода", "Весна");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",4);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Апрель");
	ЗаписьСтруктура.Вставить("НомерКвартала",2);
	ЗаписьСтруктура.Вставить("ВремяГода", "Весна");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",5);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Май");
	ЗаписьСтруктура.Вставить("НомерКвартала",2);
	ЗаписьСтруктура.Вставить("ВремяГода", "Весна");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",6);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Июнь");
	ЗаписьСтруктура.Вставить("НомерКвартала",2);
	ЗаписьСтруктура.Вставить("ВремяГода", "Лето");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
    ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",7);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Июль");
	ЗаписьСтруктура.Вставить("НомерКвартала",3);
	ЗаписьСтруктура.Вставить("ВремяГода", "Лето");

	МассивМесяцев.Добавить(ЗаписьСтруктура);

	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",8);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Август");
	ЗаписьСтруктура.Вставить("НомерКвартала",3);
	ЗаписьСтруктура.Вставить("ВремяГода", "Лето");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",9);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Сентябрь");
	ЗаписьСтруктура.Вставить("НомерКвартала",3);
	ЗаписьСтруктура.Вставить("ВремяГода", "Осень");

	МассивМесяцев.Добавить(ЗаписьСтруктура);

	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",10);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Октябрь");
	ЗаписьСтруктура.Вставить("НомерКвартала",4);
	ЗаписьСтруктура.Вставить("ВремяГода", "Осень");

	МассивМесяцев.Добавить(ЗаписьСтруктура);

	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",11);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Ноябрь");
	ЗаписьСтруктура.Вставить("НомерКвартала",4);
	ЗаписьСтруктура.Вставить("ВремяГода", "Осень");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ЗаписьСтруктура = Новый Структура;
	
	ЗаписьСтруктура.Вставить("НомерВГоду",12);
	ЗаписьСтруктура.Вставить("НазваниеМесяца","Декабрь");
	ЗаписьСтруктура.Вставить("НомерКвартала",4);
	ЗаписьСтруктура.Вставить("ВремяГода", "Зима");

	МассивМесяцев.Добавить(ЗаписьСтруктура);
	
	ПоказатьМассивДанных(МассивМесяцев);
	СообщитьОМассиве(МассивМесяцев);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьМассив(Команда)
	
    ТЗнаФорме.Очистить();
	Сообщить("Массив структур пуст. Данные удалены.");
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКоличествоЭлементовСтруктуры(Команда)
	
  НашаСтруктура = Новый Структура("НомерВГоду, НазваниеМесяца, НомерКвартала, ВремяГода");
  Сообщить("Количество элементов структуры " + НашаСтруктура.Количество());	
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиЗначенияСвойства(Команда)
	
	МассивМесяцев    = Новый Массив;
	ЗаполнениеМассиваДанными(МассивМесяцев);
	ЗначениеСвойства = Неопределено;
	Индекс=0;
	Для каждого ЭлементМассиваМесяцев Из МассивМесяцев Цикл
		Индекс = Индекс + 1;
		
		Если ЭлементМассиваМесяцев.Свойство(ВведитеКлючДляПоискаСвойства, ЗначениеСвойства) Тогда
			Сообщить("Структура " + Строка(Индекс) + ": Ключ найден. Значение: " + Строка(ЗначениеСвойства));
		Иначе
			Сообщить("Структура " + Строка(Индекс) + ": Ключ не найден");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


